{
    "Home":"Casa",
     "Career":"Carreira",
    "Projects":"Projectos",
    "Resume":"Resume",
    "Contact":"Contacto",
    "I":"Eu sou David Correia",
    "Hi":"Olá, eu sou desenvolvedor web júnior",
    "Passionate":"Apaixonado por codigo e tecnologia",
    "Eager":"Empolgado para mergulhar na indústria",

    "Soul":"Soul campers, Agente de Serviço de Aluguer",
    "DetailsSoul":"Gestão de reservas recebidas, acolhimento dos hóspedes efetuando check-ins e check-outs. Preparação minuciosa e limpeza das autocaravanas. Manutenção e supervisão constante das autocaravanas. Registo dos hóspedes, monitorização do inventário e processamento de pagamentos. Lidar com reclamações e resolver emergências com prontidão.",
    "DurationS":"3 anos",

   "Ozadi": "Ozadi Hotel, Economato",
"DetailsOzadi": "Realizar tarefas relacionadas com o Economato/Compras. Receber fornecedores, analisar se o produto apresenta as condições necessárias e se não houve equívocos. Distribuir os produtos por departamento do hotel e verificar se estão em conformidade com as regras de HACCP. Lançar faturas, notas de crédito e guias de remessa no sistema PMS.",
"DurationO": "6 meses",

"Ryanair": "Ryanair, Operador de Assistência em Terra",
"DetailsRyanair": "Operador de assistência em terra. Realizar tarefas de carregamento, descarregamento e transporte de bagagem, carga e correio de e para aviões, armazéns e terminais. Conduzir veículos e reboques de material e posicionar equipamentos de suporte às aeronaves. Receção de passageiros.",
"DurationR": "2 anos",

"Portway": "Operador de Assistência em Terra",
"DetailsPortway": "Realizar as mesmas funções do emprego mencionado anteriormente",
"DurationP": "3 anos",

"Tcareer":"Empregos",

"ProjectsT": "Projectos",
"ProjectDetails":"Esses projetos foram concluídos durante o Bootcamp da Ironhack. RatAttack foi desenvolvido individualmente, enquanto os outros foram feitos em duplas, com um prazo de uma semana para cada projeto. As principais ferramentas utilizadas foram MongoDB, React, JavaScript, Express, Node.js, CSS, Bootstrap, Postman, Axios e várias outras."




}