{
  "Home": "Casa",
  "Career": "Carreira",
  "Projects": "Projectos",
 
  "Contact": "Contacto",
  "I": "Eu sou David Correia",
  "Hi": "Olá, eu sou desenvolvedor web júnior",
  "Passionate": "Apaixonado por codigo e tecnologia",
  "Eager": "Empolgado para mergulhar na indústria",

  "Free":"Freelancer Full stack Developer",
  "DetailsFree":"Adquiri mais experiência através de trabalhos em regime de freelancing, procurando ativamente online por potenciais clientes que necessitassem de websites. Este esforço implicou não só a compreensão das necessidades específicas de cada cliente, mas também o desenvolvimento de soluções web à medida. A interação com clientes de diversos sectores permitiu-me aprimorar as competências de comunicação e alargar o meu portfólio.",
  "DurationZ":"Actualmente",

  "Soul": "Soul campers, Agente de Serviço de Aluguer",
  "DetailsSoul": "Gestão de reservas recebidas, acolhimento dos hóspedes efetuando check-ins , check-outs e apoio ao cliente. Manutenção e supervisão constante das autocaravanas. Registo dos hóspedes, monitorização do inventário e processamento de pagamentos. Lidar com reclamações e resolver emergências com prontidão. ",
  "DurationS": "3 anos",

  "Ozadi": "Ozadi Hotel, Economato",
  "DetailsOzadi": "Realizar tarefas relacionadas com o Economato/Compras. Receber fornecedores, analisar se o produto apresenta as condições necessárias e se não houve equívocos. Distribuir os produtos por departamento do hotel e verificar se estão em conformidade com as regras de HACCP. Lançar faturas, notas de crédito e guias de remessa no sistema PMS.",
  "DurationO": "6 meses",

  "Ryanair": "Ryanair, Operador de Assistência em Terra",
  "DetailsRyanair": "Operador de assistência em terra. Realizar tarefas de carregamento, descarregamento e transporte de bagagem, carga e correio de e para aviões, armazéns e terminais. Conduzir veículos e reboques de material e posicionar equipamentos de suporte às aeronaves. Receção de passageiros.",
  "DurationR": "2 anos",

  "Hotel": "Escola Superior de Hotelaria e Turismo do Algarve(UALG).",
  "DurationH": "4 anos",
  "DetailsHotel": "Licenciatura em Gestão Hoteleira",

  "Portway": "Operador de Assistência em Terra",
  "DetailsPortway": "Realizar as mesmas funções do emprego mencionado anteriormente",
  "DurationP": "3 anos",

  "Tcareer": "Carreira",

  "ProjectsT": "Projectos",
  "ProjectDetails":"Desenvolvi projetos utilizando principalmente JavaScript, React e Angular para o frontend, com tecnologias de backend incluindo Node.js com Express.js, Next.js, e Supabase. Middleware e React Query foram fundamentais para facilitar a comunicação e a gestão de dados entre o frontend e o backend, otimizando as interações. Para a estilização, usei CSS, Tailwind e Styled Components. Integrei diversas APIs, como a Geolocation API, OAuth 2.0, Google APIs, IMDb API, Spotify, AWS, além de utilizar o MongoDB como banco de dados, criando soluções dinâmicas e interativas, ainda adquiri experiência com gestão de CPanel, Deploy, domains e dns e teste de rotas com Postman e Thunder Client",

  "PreCourse": "Pré-Curso",
  "PreDetails": "Durante a preparação pré-bootcamp na Ironhack, passei por 50 a 75 horas de treinamento em JavaScript, HTML, CSS, Git e GitHub. Esta preparação abrangente garantiu que eu estivesse totalmente preparado para uma experiência bem-sucedida no Bootcamp.",

  "Module1": "Módulo 1: Aprendi HTML, CSS e JavaScript para desenvolvimento web e criei um jogo personalizado com design responsivo usando CSS e JavaScript.",
  "Module2": "Módulo 2: Aprendi e pratiquei desenvolvimento de back-end com Node.js, Express.js, Handlebars e MongoDB. Construí servidores, trabalhei com bancos de dados, integrei APIs, testei rotas com o Postman e implantei projetos.",
  "Module3": "Módulo 3: Tornei-me proficiente em ReactJS. Desenvolvi uma aplicação full-stack combinando habilidades de back-end com ReactJS para proporcionar uma experiência de usuário perfeita.",
  "FinalProject": "Projeto Final: Após aproximadamente 500 a 600 horas de aprendizado intensivo, prática extensiva e implementação de projetos, apresentei todas as minhas habilidades criando uma aplicação full-stack baseada em MERN.",

  "NAME": "NOME",
  "subject": "SUJEITO",
  "PHONE": "TELEFONE",
  "MESSAGE": "MENSAGEM",
  "sMESSAGE": "Enviar Mensagem"
}
